[
  {
    "incidentDate": "June 11, 2025",
    "nhtsaId": "11666249",
    "consumerLocation": "VICKSBURG, MS",
    "vin": "2HKRS3H74SH****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 My windshield wipers are ineffective.  The liquid cleaner does not spray until the wipers are pointing out, thus causing the liquid spray to roll off the car and NOT clean the spots in the driver's field of vision. The miniscule amount of liquid left on the wipers simply smears the debris on the windshield resulting in a driving hazard. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 7, 2025",
    "nhtsaId": "11665462",
    "consumerLocation": "Unknown",
    "vin": "7FARS5H85SE****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 Fuel injector failure.  Causing spark plug and emission problems. Vehicle 5100 miles \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 6, 2025",
    "nhtsaId": "11665329",
    "consumerLocation": "PITTSBURG, CA",
    "vin": "2HKRS5H87SH****",
    "summary": "CrashYes FireNo Injuries1 Deaths0 I was parking in our apartment's parking lot when I attempted a left turn to pull in front-facing toward the wall. Within seconds, and without understanding how or why, the car continued forward and hit the wall.  Initially, I reported to the insurance company that I either didn’t brake or found the brake too late. However, the truth is—I do not clearly remember what happened.  My mph had to be low.  When the car hit the wall, several emergency systems were triggered: an automatic emergency call was made, collision alerts sounded, and the brakes activated. During the collision, my left arm was burned by the steering wheel where the Honda logo is located. The burn left a visible imprint of the Honda logo on my skin.  Only some of the airbags deployed: the steering wheel and right-side window airbags were activated. However, the driver's side window airbags did not deploy.  My concerns and complaints include:  1. The failure of the driver’s window airbag to deploy  2. The burn on my arm caused by the steering wheel’s Honda emblem  3. The inconsistent performance of the emergency braking system, which only works sometimes \n\t\t\t\t1 Affected Product      ",
    "crash": "Yes",
    "fire": "No",
    "injuries": "1",
    "deaths": "0"
  },
  {
    "incidentDate": "June 4, 2025",
    "nhtsaId": "11664845",
    "consumerLocation": "RONKONKOMA, NY",
    "vin": "5J6RS6H84SL****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 The contact owns a 2025 Honda CR-V. The contact received notification of NHTSA Campaign Number: 24V744000 (Steering); however, the part to do the recall repair was unavailable. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The dealer was contacted; however, the dealer had not returned the call to schedule an appointment. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 4, 2025",
    "nhtsaId": "11664930",
    "consumerLocation": "LAS VEGAS, NV",
    "vin": "2HKRS4H47SH****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 103H tire  So after I get the car from dealership, the next week I had a sign or tire low pressure by the dashboard and I start checking everyday and I figured out that is specifically is by the driver side tire is low pressure. First I took it to discount tire to see and they said I don't see any flat tire or any issues and he pump them all and tried to balance them . But still the sign in the dashboard so I decided to take it to dealership and they said maybe only the dashboard computer and they fixed it and was not showing that day as the sign went from TEMPS setting. Next day I have the sign again pops up and I scheduled second appointment with the Honda west dealership to check entire tire.They did and said we didn't see anything wrong and we fixed it again in the dashboard.i went home and next day same issue again the dashboard sign shows low pressure and also the tire itself went low pressure was not balanced everytime they blow air on it and goes low again in few minutes.i bring it again for third time and the worse sinario is that the mechanical agent touch something in the engine and the oil explodes all over the engine areas causing leak and smoke all over and oil splashed everywhere inside and outside and I have videos and photos. \n\t\t\t\t2 Affected Products      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 11, 2025",
    "nhtsaId": "11666249",
    "consumerLocation": "VICKSBURG, MS",
    "vin": "2HKRS3H74SH****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 My windshield wipers are ineffective.  The liquid cleaner does not spray until the wipers are pointing out, thus causing the liquid spray to roll off the car and NOT clean the spots in the driver's field of vision. The miniscule amount of liquid left on the wipers simply smears the debris on the windshield resulting in a driving hazard. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 7, 2025",
    "nhtsaId": "11665462",
    "consumerLocation": "Unknown",
    "vin": "7FARS5H85SE****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 Fuel injector failure.  Causing spark plug and emission problems. Vehicle 5100 miles \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 6, 2025",
    "nhtsaId": "11665329",
    "consumerLocation": "PITTSBURG, CA",
    "vin": "2HKRS5H87SH****",
    "summary": "CrashYes FireNo Injuries1 Deaths0 I was parking in our apartment's parking lot when I attempted a left turn to pull in front-facing toward the wall. Within seconds, and without understanding how or why, the car continued forward and hit the wall.  Initially, I reported to the insurance company that I either didn’t brake or found the brake too late. However, the truth is—I do not clearly remember what happened.  My mph had to be low.  When the car hit the wall, several emergency systems were triggered: an automatic emergency call was made, collision alerts sounded, and the brakes activated. During the collision, my left arm was burned by the steering wheel where the Honda logo is located. The burn left a visible imprint of the Honda logo on my skin.  Only some of the airbags deployed: the steering wheel and right-side window airbags were activated. However, the driver's side window airbags did not deploy.  My concerns and complaints include:  1. The failure of the driver’s window airbag to deploy  2. The burn on my arm caused by the steering wheel’s Honda emblem  3. The inconsistent performance of the emergency braking system, which only works sometimes \n\t\t\t\t1 Affected Product      ",
    "crash": "Yes",
    "fire": "No",
    "injuries": "1",
    "deaths": "0"
  },
  {
    "incidentDate": "June 4, 2025",
    "nhtsaId": "11664845",
    "consumerLocation": "RONKONKOMA, NY",
    "vin": "5J6RS6H84SL****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 The contact owns a 2025 Honda CR-V. The contact received notification of NHTSA Campaign Number: 24V744000 (Steering); however, the part to do the recall repair was unavailable. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The dealer was contacted; however, the dealer had not returned the call to schedule an appointment. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 4, 2025",
    "nhtsaId": "11664930",
    "consumerLocation": "LAS VEGAS, NV",
    "vin": "2HKRS4H47SH****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 103H tire  So after I get the car from dealership, the next week I had a sign or tire low pressure by the dashboard and I start checking everyday and I figured out that is specifically is by the driver side tire is low pressure. First I took it to discount tire to see and they said I don't see any flat tire or any issues and he pump them all and tried to balance them . But still the sign in the dashboard so I decided to take it to dealership and they said maybe only the dashboard computer and they fixed it and was not showing that day as the sign went from TEMPS setting. Next day I have the sign again pops up and I scheduled second appointment with the Honda west dealership to check entire tire.They did and said we didn't see anything wrong and we fixed it again in the dashboard.i went home and next day same issue again the dashboard sign shows low pressure and also the tire itself went low pressure was not balanced everytime they blow air on it and goes low again in few minutes.i bring it again for third time and the worse sinario is that the mechanical agent touch something in the engine and the oil explodes all over the engine areas causing leak and smoke all over and oil splashed everywhere inside and outside and I have videos and photos. \n\t\t\t\t2 Affected Products      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 4, 2025",
    "nhtsaId": "11664744",
    "consumerLocation": "TULSA, OK",
    "vin": "KNDNC5KA9S6****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 2025 KIA Carnival Hybrid gets stuck in electric mode. This cause rapid draining of the electric vehicle battery, reduced maximum speed, and reduced acceleration.  This has occurred while merging onto the highway.  I had to pull over to the highway on ramp shoulder, turn the vehicle off and back, and then merge back until the highway.  I have a video of it happening while picking up my kids from school, but it is too large to upload here. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "May 18, 2025",
    "nhtsaId": "11661724",
    "consumerLocation": "Unknown",
    "vin": "KNDNE5K37S6****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 Carnival came with DVD players for kids in the back seat. It contains a volume control that can be controlled by the child. The child at any point can blast the stereo insanely high which can distract the driver and could cause an accident. This needs to be recalled immediately. There is no reason for the sound to be able to be blasted that loud. Then if it happens, there is no fast way to turn it down which causes the driver to fumble. Please look into this immediately as it can effect any owner. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "May 12, 2025",
    "nhtsaId": "11660327",
    "consumerLocation": "LEO-CEDARVILLE, IN",
    "vin": "KNDNE5KA8S6****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 The \"consider taking a break\" feature pops up every 5 minutes when I am driving and it is beyond distracting and leads me to believe I have something wrong with my vehicle. There is no way to turn it off. Please demand that Hyundai/Kia issue a software update so I can turn this off. Thnaks! \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "May 9, 2025",
    "nhtsaId": "11659865",
    "consumerLocation": "CASTRO VALLEY, CA",
    "vin": "KNDNE5KA8S6****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 The Kia Carnival Hybrid wouldn't allow me to accelerate, topping out at 30/31 MPH despite me fully pressing down on the accelerator. It has happened twice now (a few days apart) and can only be resolved by turning the car off and then back on. Compared to similar complaints logged on the NHTSA website, the difference is that this happened when it was roughly 50-60 degrees outside--not during extremely low temperatures as the other examples have described. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "May 1, 2025",
    "nhtsaId": "11658095",
    "consumerLocation": "MENA, AR",
    "vin": "KNDNC5KA3S6****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 When pulling out onto the highway from my drive way the car would no accelerate when I pressed the gas, the car would not exceed 35mph, when caused me and my kids to almost get rear ended when pulling out since the car would not go..... the car will start to flash a \" check hybrid system pull over safely\" light and then the car will start to coast and I have to find somewhere safe to coast off to, to turn the vehicle off and then on again, it will run fine after that but it will eventually do it again... I have taken the car to 2 different dealerships to have it looked and and they tell me nothing is wrong with it \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 12, 2025",
    "nhtsaId": "11666513",
    "consumerLocation": "MARSHALL, TX",
    "vin": "1C6RREGG2SN****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 The contact owns a 2025 Ram 1500. The contact stated that the vehicle had been experiencing difficulty starting. The contact stated that the vehicle was able to restart after several attempts. The vehicle was taken to the dealer, where the failure could not be duplicated; however, the failure recurred. The vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The failure mileage was approximately 6,000. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 10, 2025",
    "nhtsaId": "11666118",
    "consumerLocation": "YORKTOWN, VA",
    "vin": "1C6RRFGG7SN****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 The contact owns a 2025 Ram 1500. The contact stated while driving at an undisclosed speed, the engine warning light illuminated. The contact stated that the failure occurred six days after the vehicle was purchased. The vehicle was taken to the dealer where it was diagnosed with multi-engine misfire, DTC: P0300. The contact was informed that a software update was needed. The vehicle was repaired. In addition, the contact stated the software had been updated twice; however, the contact was informed that the software update was a temporary fix. The contact stated that the failure reoccurred. The contact stated that while driving at an undisclosed speed, the accelerator pedal was depressed; however, the vehicle failed to accelerate as intended. The dealer declined to update the software another time. Additionally, the dealer declined to buy back the vehicle. The manufacturer was made aware of the failure and a case was filed. The failure mileage was approximately 487. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 9, 2025",
    "nhtsaId": "11665717",
    "consumerLocation": "DEFUNIAK SPRINGS, FL",
    "vin": "1C6RREGG0SN****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 The contact owns a 2025 Ram 1500. The contact stated while driving approximately 45 MPH, the steering wheel became very difficult to turn to the left or the right. The contact depressed the brake pedal, and the pedal was very soft. The contact stated that there were several unknown warning lights illuminated. The contact drove the vehicle back to the residence and then had the vehicle towed to a dealer. The dealer was unable to diagnose the vehicle. The vehicle was not repaired. Additionally, the contact stated that there was an electrical failure and the radio failed to shutoff after turning off and exiting the vehicle. The manufacturer was not informed of the failure. The failure mileage was approximately 3,400. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 9, 2025",
    "nhtsaId": "11665749",
    "consumerLocation": "BENSON, NC",
    "vin": "1C6RRFCG7SN****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 2025 Ram 1500 V6 eTorque hydraulic tensioner for MGU belt caused belt to break while traveling out of state from NY to NC. This caused the battery waning light to come on and also the CEL. Vehicle would not charge and would not run properly, all advanced safety features diminished. Vehicle brought directly to Dodge dealership in Laurel MD during incident. Vehicle was repaired on 6/6/2025 at Dodge dealership in MD. While traveling home to NC from MD on [XXX] Amp meter was not functioning, vehicle would  not shift out of 7th gear with cruise control on, gas mileage has decreased to 10-12 miles per gallon at highway speeds and vehicle has poor engine power, all while driving on [XXX]. Total mileage on vehicle is 6600 miles. Ram care is no help, Case # with Ram care is [XXX]. Have not been able to speak with anyone about a resolution, nor have I been able to speak with the assigned case manager at all despite numerous phone calls, voicemails and emails.   INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6) \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  },
  {
    "incidentDate": "June 9, 2025",
    "nhtsaId": "11665771",
    "consumerLocation": "Unknown",
    "vin": "1C6SRFFP5SN****",
    "summary": "CrashNo FireNo Injuries0 Deaths0 I am leasing a 2025 Ram 1500 Bighorn from Stellantis.  In the less than a year I have owned this it has been to 2 dealerships over 5 times.  I hired Handy Law Offices to file a lemon claim . Stellantis was supposed to respond by May 26 and here it is June 9 and they still refuse to acknowledge the problems.  And to top it off, I found a positive wire with a split open covering and Summit Automotive in Fond du Lac Wisconsin refuses to fix it, even though they sold me the truck.  In talking to other dealerships, this is a shorting hazard and possible fire, but they said Summit has to fix it. I want to know what legal avenues I have to get rid of this truck. I have learned that more and more of this year truck is also experiencing bad problems that Stellantis refuses to acknowledge. And if my truck catches fire there will be additional lawsuits for negligence against Summit Automotive. \n\t\t\t\t1 Affected Product      ",
    "crash": "No",
    "fire": "No",
    "injuries": "0",
    "deaths": "0"
  }
]